/* automatically generated by rust-bindgen */

#[doc = " @brief Callback function for mouse events. see cv::setMouseCallback"]
#[doc = "@param event one of the cv::MouseEventTypes constants."]
#[doc = "@param x The x-coordinate of the mouse event."]
#[doc = "@param y The y-coordinate of the mouse event."]
#[doc = "@param flags one of the cv::MouseEventFlags constants."]
#[doc = "@param userdata The optional parameter."]
pub type cv_MouseCallback = u64;
pub const cv_text_classifier_type_OCR_KNN_CLASSIFIER: cv_text_classifier_type = 0;
pub const cv_text_classifier_type_OCR_CNN_CLASSIFIER: cv_text_classifier_type = 1;
pub type cv_text_classifier_type = i32;
#[repr(C)]
pub struct cvsys_Point2i {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cvsys_Point2i() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_Point2i>(),
        8usize,
        concat!("Size of: ", stringify!(cvsys_Point2i))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_Point2i>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_Point2i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Point2i>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_Point2i), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Point2i>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cvsys_Point2i), "::", stringify!(y))
    );
}
#[repr(C)]
pub struct cvsys_Point2f {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_cvsys_Point2f() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_Point2f>(),
        8usize,
        concat!("Size of: ", stringify!(cvsys_Point2f))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_Point2f>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_Point2f))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Point2f>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_Point2f), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Point2f>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cvsys_Point2f), "::", stringify!(y))
    );
}
#[repr(C)]
pub struct cvsys_Size2i {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cvsys_Size2i() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_Size2i>(),
        8usize,
        concat!("Size of: ", stringify!(cvsys_Size2i))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_Size2i>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_Size2i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Size2i>())).width as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_Size2i), "::", stringify!(width))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Size2i>())).height as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cvsys_Size2i), "::", stringify!(height))
    );
}
#[repr(C)]
pub struct cvsys_Size2f {
    pub width: f32,
    pub height: f32,
}
#[test]
fn bindgen_test_layout_cvsys_Size2f() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_Size2f>(),
        8usize,
        concat!("Size of: ", stringify!(cvsys_Size2f))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_Size2f>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_Size2f))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Size2f>())).width as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_Size2f), "::", stringify!(width))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Size2f>())).height as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cvsys_Size2f), "::", stringify!(height))
    );
}
#[repr(C)]
pub struct cvsys_Rect {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cvsys_Rect() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_Rect>(),
        16usize,
        concat!("Size of: ", stringify!(cvsys_Rect))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_Rect>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_Rect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Rect>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_Rect), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Rect>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cvsys_Rect), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Rect>())).width as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(cvsys_Rect), "::", stringify!(width))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Rect>())).height as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(cvsys_Rect), "::", stringify!(height))
    );
}
#[repr(C)]
pub struct cvsys_RotatedRect {
    pub center: cvsys_Point2f,
    pub size: cvsys_Size2f,
    pub angle: f32,
}
#[test]
fn bindgen_test_layout_cvsys_RotatedRect() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_RotatedRect>(),
        20usize,
        concat!("Size of: ", stringify!(cvsys_RotatedRect))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_RotatedRect>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_RotatedRect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_RotatedRect>())).center as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_RotatedRect),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_RotatedRect>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_RotatedRect),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_RotatedRect>())).angle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_RotatedRect),
            "::",
            stringify!(angle)
        )
    );
}
#[repr(C)]
pub struct cvsys_Scalar {
    pub v0: ::std::os::raw::c_int,
    pub v1: ::std::os::raw::c_int,
    pub v2: ::std::os::raw::c_int,
    pub v3: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cvsys_Scalar() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_Scalar>(),
        16usize,
        concat!("Size of: ", stringify!(cvsys_Scalar))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_Scalar>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_Scalar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Scalar>())).v0 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_Scalar), "::", stringify!(v0))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Scalar>())).v1 as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cvsys_Scalar), "::", stringify!(v1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Scalar>())).v2 as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(cvsys_Scalar), "::", stringify!(v2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_Scalar>())).v3 as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(cvsys_Scalar), "::", stringify!(v3))
    );
}
#[repr(C)]
pub struct cvsys_KeyPoint {
    pub pt: cvsys_Point2f,
    pub size: f32,
    pub angle: f32,
    pub response: f32,
    pub octave: ::std::os::raw::c_int,
    pub class_id: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cvsys_KeyPoint() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_KeyPoint>(),
        28usize,
        concat!("Size of: ", stringify!(cvsys_KeyPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_KeyPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_KeyPoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_KeyPoint>())).pt as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_KeyPoint), "::", stringify!(pt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_KeyPoint>())).size as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(cvsys_KeyPoint), "::", stringify!(size))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_KeyPoint>())).angle as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(cvsys_KeyPoint), "::", stringify!(angle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_KeyPoint>())).response as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_KeyPoint),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_KeyPoint>())).octave as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_KeyPoint),
            "::",
            stringify!(octave)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_KeyPoint>())).class_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_KeyPoint),
            "::",
            stringify!(class_id)
        )
    );
}
#[repr(C)]
pub struct cvsys_DMatch {
    pub distance: f32,
    pub imgIdx: ::std::os::raw::c_int,
    pub queryIdx: ::std::os::raw::c_int,
    pub trainIdx: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cvsys_DMatch() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_DMatch>(),
        16usize,
        concat!("Size of: ", stringify!(cvsys_DMatch))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_DMatch>(),
        4usize,
        concat!("Alignment of ", stringify!(cvsys_DMatch))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_DMatch>())).distance as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_DMatch),
            "::",
            stringify!(distance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_DMatch>())).imgIdx as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cvsys_DMatch), "::", stringify!(imgIdx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_DMatch>())).queryIdx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_DMatch),
            "::",
            stringify!(queryIdx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_DMatch>())).trainIdx as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_DMatch),
            "::",
            stringify!(trainIdx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct cvsys_CString {
    pub value: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_cvsys_CString() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_CString>(),
        8usize,
        concat!("Size of: ", stringify!(cvsys_CString))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_CString>(),
        8usize,
        concat!("Alignment of ", stringify!(cvsys_CString))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_CString>())).value as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cvsys_CString), "::", stringify!(value))
    );
}
extern "C" {
    #[link_name = "\u{1}?is_str@CString@cvsys@@QEBA_NXZ"]
    pub fn cvsys_CString_is_str(this: *const cvsys_CString) -> bool;
}
extern "C" {
    #[link_name = "\u{1}?get_str@CString@cvsys@@QEBAPEBDXZ"]
    pub fn cvsys_CString_get_str(this: *const cvsys_CString) -> *const ::std::os::raw::c_char;
}
impl cvsys_CString {
    #[inline]
    pub unsafe fn is_str(&self) -> bool {
        cvsys_CString_is_str(self)
    }
    #[inline]
    pub unsafe fn get_str(&self) -> *const ::std::os::raw::c_char {
        cvsys_CString_get_str(self)
    }
}
#[repr(C)]
pub struct cvsys_Result<T> {
    pub value: T,
    pub error: cvsys_CString,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
#[repr(C)]
#[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct cvsys_EmptyResult {
    pub error: cvsys_CString,
}
#[test]
fn bindgen_test_layout_cvsys_EmptyResult() {
    assert_eq!(
        ::std::mem::size_of::<cvsys_EmptyResult>(),
        8usize,
        concat!("Size of: ", stringify!(cvsys_EmptyResult))
    );
    assert_eq!(
        ::std::mem::align_of::<cvsys_EmptyResult>(),
        8usize,
        concat!("Alignment of ", stringify!(cvsys_EmptyResult))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvsys_EmptyResult>())).error as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cvsys_EmptyResult),
            "::",
            stringify!(error)
        )
    );
}
#[repr(C)]
pub struct cvsys_CVec<T> {
    pub array: *mut T,
    pub size: usize,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
#[repr(C)]
pub struct cvsys_COption<T> {
    pub hasValue: bool,
    pub value: T,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
extern "C" {
    #[link_name = "\u{1}?mat_from_file_storage@cvsys@@YAPEAVMat@cv@@PEBD0@Z"]
    pub fn cvsys_mat_from_file_storage(
        path: *const ::std::os::raw::c_char,
        section: *const ::std::os::raw::c_char,
    ) -> *mut cv_Mat;
}
extern "C" {
    #[link_name = "\u{1}?mat_new@cvsys@@YAPEAVMat@cv@@XZ"]
    pub fn cvsys_mat_new() -> *mut cv_Mat;
}
extern "C" {
    #[link_name = "\u{1}?mat_new_with_size@cvsys@@YAPEAVMat@cv@@HHH@Z"]
    pub fn cvsys_mat_new_with_size(
        rows: ::std::os::raw::c_int,
